---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeCreaseArray.IsEmpty
source: html/e36e7e38-64ba-6988-ae7d-c3945bf48338.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.